my_dict = {'Владимир': 1995, 'Петр': 2001, 'Василий': 1999}

# Выводим словарь на экран
print(my_dict)
print('-------------------------------------------------------------------')

# Выводим ключ существующего значения
print(my_dict['Петр'])
print('-------------------------------------------------------------------')
# Выводим ключ не существующего значения
print(my_dict.get('Максим'))
print('-------------------------------------------------------------------')
# Добавляем две новые пары
my_dict.update({'Евгений': 1996, 'Алексей': 2000})

# удаляем одну из пар и выводим ее ключ  на экран
a = my_dict.pop('Василий')
print(a)
print('-------------------------------------------------------------------')
# Выводим обновленный словарь
print(my_dict)
print('-------------------------------------------------------------------')

# Создаем множество
my_set = {1, 2, 3, 4, 2, 3, 4, 5, True, 'String', (1, 2, 3), (1, 2, 3)}
print(my_set)
print('-------------------------------------------------------------------')
# Добавляем значение
my_set.add(6)
print(my_set)
print('-------------------------------------------------------------------')
# Удвляем значение из множества
my_set.discard(4)
print(my_set)
print('-------------------------------------------------------------------')