# Пишем и запускаем первый блок кода
print('Первый блок кода')
print('================')

x = 38

print('Здравствуйте')
if x < 0:
    print('меньше нуля')
print('Досвидания')
print('_______________________________________________________________________')

# Пишем и запускаем второй блок кода

# Примеры
print('Второй блок кода')
print('================')

a, b = 10, 5

if a > b:
    print('a > b')
if a > b and a > 0:
    print('Успех!')
if (a > b) and (a > 0 or b < 1000):
    print('Успех!')
if 5 < b and b < 10:
    print('Успех!')
print('_______________________________________________________________________')

# Пишем и запускаем третий блок кода

# Можно сравнивать - числа, строки, списки, вообще - всё
print('Третий блок кода')
print('================')

if '34' > '123':
    print('Успех!')

if '123' > '12':
    print('Успех!')

if [1, 2] > [1, 1]:
    print('Успех!')
print('_______________________________________________________________________')

# Пишем и запускаем четвертый блок кода

# Что нельзя сравнивать? - разные типы
print('четвертый блок кода')
print('===================')

if '6' > 5:
    print('Успех!')

if [5, 6] > 5:
    print('Успех!')

# Но

if '6' != 5:
    print('Успех!')
print('_______________________________________________________________________')